[
    {
        "id" : 1,
        "title" : "Hijab row: SC notice to Karnataka govt",
        "dec" : "New Delhi: The Supreme Court today issued a notice to Karnataka government on pleas challenging High Court verdict refusing to lift ban on hijab in educational institutions of the state. The apex court, however, upheld the ban and fixed the next date for hearing on September 5.A top court bench comprising justices Hemant Gupta and Sudhanshu Dhulia said that it will not accept a plea seeking adjournment as an early hearing was sought, while issuing notice to the Karnataka government. The also pulled up some of the petitioners, who sought adjournment in the matter, and said it would not permit “this kind of forum shopping”.Several petitions have been filed in the apex court against the Karnataka High Court verdict holding that wearing of hijab is not a part of the essential religious practice which can be protected under Article 25 of the Constitution.The Karnataka HC had dismissed the petitions filed by a section of Muslim students from the government Pre-University Girls College in Udupi, seeking permission to wear hijab inside classroom."
    },
    {
        "id" : 2,
        "title" : "Dollar hits 20-year high as markets hunker down for higher rates for longer",
        "dec" : "The US dollar climbed to a 20-year high against other major currencies on Monday after Federal Reserve Chair Jerome Powell signalled interest rates would be kept higher for longer to bring down soaring inflation.The dollar index, which measures the currency's value against a basket of peers, scaled a fresh two-decade peak of 109.48.That left its European peers in the doldrums even as hawkish European Central Bank comments boosted expectations for a supersized September rate hike.The euro was down a quarter of a percent in early European trade at $0.99415, within sight of recent 20-year lows, while Britain's pound sank to a 2-1/2 year low.London markets were closed for a public holiday.Powell told the Jackson Hole central banking conference in Wyoming on Friday that the Fed would raise rates as high as needed to restrict growth, and would keep them there 'for some time' to bring down inflation that is running at more than three times the Fed's 2% goal."
    }
]